normalize

Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_6 (Batch (None, 8)                 32        
_________________________________________________________________
dense_23 (Dense)             (None, 100)               900       
_________________________________________________________________
dense_24 (Dense)             (None, 100)               10100     
_________________________________________________________________
dense_25 (Dense)             (None, 50)                5050      
_________________________________________________________________
dense_26 (Dense)             (None, 1)                 51        
=================================================================
Total params: 16,133
Trainable params: 16,117
Non-trainable params: 16
_________________________________________________________________
None 

{'verbose': 1, 'epochs': 300, 'steps': 20} 

mean train loss last 10 epochs: 33.97813415527344
mean train r^2 last 10 epochs: 0.8510811030864716