normalized

Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization (BatchNo (None, 8)                 32        
_________________________________________________________________
dense_21 (Dense)             (None, 100)               900       
_________________________________________________________________
dense_22 (Dense)             (None, 50)                5050      
_________________________________________________________________
dense_23 (Dense)             (None, 1)                 51        
=================================================================
Total params: 6,033
Trainable params: 6,017
Non-trainable params: 16
_________________________________________________________________
None 

{'verbose': 1, 'epochs': 300, 'steps': 16} 

loss: 42.8785 - r_square: 0.8271 - val_loss: 35.0651 - val_r_square: 0.8505