normalized

Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_5 (Batch (None, 8)                 32        
_________________________________________________________________
dense_19 (Dense)             (None, 100)               900       
_________________________________________________________________
dense_20 (Dense)             (None, 100)               10100     
_________________________________________________________________
dense_21 (Dense)             (None, 50)                5050      
_________________________________________________________________
dense_22 (Dense)             (None, 1)                 51        
=================================================================
Total params: 16,133
Trainable params: 16,117
Non-trainable params: 16
_________________________________________________________________
None 

{'verbose': 1, 'epochs': 300, 'steps': 16} 

loss: 29.5367 - r_square: 0.8856 - val_loss: 33.8193 - val_r_square: 0.8498
