standardscaler

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_1 (Batch (None, 8)                 32        
_________________________________________________________________
dense_4 (Dense)              (None, 100)               900       
_________________________________________________________________
dense_5 (Dense)              (None, 100)               10100     
_________________________________________________________________
dense_6 (Dense)              (None, 100)               10100     
_________________________________________________________________
dense_7 (Dense)              (None, 1)                 101       
=================================================================
Total params: 21,233
Trainable params: 21,217
Non-trainable params: 16
_________________________________________________________________
None 

{'verbose': 1, 'epochs': 500, 'steps': 18} 

mean train loss last 10 epochs: 24.349287033081055
mean train r^2 last 10 epochs: 0.9055534243583679

