standardscaler

Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_32 (Dense)             (None, 200)               1800      
_________________________________________________________________
dense_33 (Dense)             (None, 100)               20100     
_________________________________________________________________
dense_34 (Dense)             (None, 100)               10100     
_________________________________________________________________
dense_35 (Dense)             (None, 1)                 101       
=================================================================
Total params: 32,101
Trainable params: 32,101
Non-trainable params: 0
_________________________________________________________________
None 

{'verbose': 1, 'epochs': 300, 'steps': 23} 

mean train loss last 10 epochs: 0.03489189613610506
mean train r^2 last 10 epochs: 0.9730029821395874
